org/k8s.org
:PROPERTIES:
:ID:       A30EFBB4-484A-40FE-AFBC-C0A8C26D00D4
:END:
#+HUGO_BASE_DIR: ../
#+TITLE: Kubernetes
#+DATE: <2021-04-26 Mon 16:54>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: 
#+HUGO_CATEGORIES: 
#+HUGO_DRAFT: false

* Online Tutorials
https://kubernetes.io/docs/tutorials/kubernetes-basics/
https://kubernetes.io/zh/docs/tutorials/kubernetes-basics/
* CONCEPT
** Cluster
When you deploy Kubernetes, you get a cluster.
** Node
A Kubernetes cluster consists of a set of worker machines, called nodes, that
run containerized applications. Every cluster has at least one worker node.
** Pod
The worker node(s) host the Pods that are the components of the application
workload. The control plane manages the worker nodes and the Pods in the
cluster. In production environments, the control plane usually runs across
multiple computers and a cluster usually runs multiple nodes, providing
fault-tolerance and high availability.
** Master
** Controller
